<!DOCTYPE html>
<html>
  <meta http-equiv="content-type" content="text/html;charset=UTF-8" />
<head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <title>Générateur de nombre aléatoire en ligne</title>
    <meta name="description" content="Vous voulez Générer des Chiffres et des Nombres aléatoires? - voilà un Générateur de Chiffres et de nombres en ligne pour le faire, un outil simple, facile et rapide">

    
    

    <meta property="og:image" content="../images/fb-og-image.png">
    

    <meta name="viewport" content="width=device-width,minimum-scale=1,initial-scale=1">
    <link rel="shortcut icon" href="favicon.ico" type="image/x-icon">
    <link rel="icon" href="../favicon.ico" type="image/x-icon">

    <link rel="stylesheet" type="text/css" href="../css/reset.css">
    <link rel="stylesheet" type="text/css" href="../css/style-base-template.css">
    <link rel="stylesheet" type="text/css" href="../css/style-browser-window.css">
    <link rel="stylesheet" type="text/css" href="../css/style-menu-new.css">
    <link rel="stylesheet" type="text/css" href="../css/style-footer-new.css">

    
  <link rel="stylesheet" type="text/css" href="../css/style-tools.css">


    <link href='https://fonts.googleapis.com/css?family=Raleway' rel='stylesheet' type='text/css'>
    <link href='https://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'>

    

          

    <script src="../../ajax.googleapis.com/ajax/libs/jquery/1.11.1/jquery.min.js"></script>
    <script src="../js/sign-in-new.js"></script>
    <script src="../js/footer.js"></script>

    
  <script src="../js/tools.js"></script>
  


  </head>

  <body>
    <div id="top-container">
      <a name="top"></a>
      <div id="top">
        <div id="top-logo">
          <a href="https://convertir.github.io/" title="Github"><img src="../images/logo.png" alt="Github"></a>
        </div>
        <div id="top-nav">
          
          <div id="top-links">
            <div class="link"><a href="../about.html">A Propos</a></div>
            
            <div class="sep"></div>
            <div class="link"><a href="../contact.html">Contact</a></div>
            
            
                      </div>
        </div>
        <div class="clear"></div>
      </div>
    </div>

    
<div id="content">
  <div id="browser-window">
    <div id="browser-window-top">
      <div id="browser-window-circles">
        <div class="circle"></div>
        <div class="circle"></div>
        <div class="circle"></div>
      </div>
    </div>
    <div id="browser-window-body">
      <h1>Générateur de nombres aléatoires</h1>
      <h2>+300 outils pour les  web développeurs</h2>
      <div id="browser-window-content">
        <div id="tool-description">
		    <div>

          <script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<!-- Responsive -->
<ins class="adsbygoogle"
     style="display:block"
     data-ad-client="ca-pub-3711695498099821"
     data-ad-slot="1645253548"
     data-ad-format="auto"
     data-full-width-responsive="true"></ins>
<script>
(adsbygoogle = window.adsbygoogle || []).push({});
</script>
            </div>
			<div>
Vous voulez Générer des Chiffres et nombres aléatoires? - voilà un Générateur de nombres et de Chiffres en ligne pour le faire, un outil simple, facile et rapide
            </div>
        </div>

		
        <div id="tool-implementation">
          
<div id="tool-random-number">
  <div class="field">
    <textarea id="random-number-text"></textarea>
  </div>
  <div class="field">
    Début:
    <input id="random-number-start" value="1" size="2">
    Fin:
    <input id="random-number-end" value="1000" size="2">
    Combien?
    <input id="random-number-how-many" value="5" size="2">
  </div>
  <div class="field">
    <div id="action-error"></div>
  </div>
  <div class="field">
    <input type="submit" value="Generate Random Numbers!" id="random-number-submit"> <span id="copy-to-clipboard"><a href="#"><img src="../images/copy-to-clipboard.png" title="Copy to clipboard"></a></span> <span id="random-number-submit-undo" class="undo"><a href="#">(undo)</a></span>
  </div>
</div>

        </div>
        
<div id="inverse-tool">
<div>
<script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<!-- 728*90 -->
<ins class="adsbygoogle"
     style="display:inline-block;width:728px;height:90px"
     data-ad-client="ca-pub-3711695498099821"
     data-ad-slot="2017143857"></ins>
<script>
(adsbygoogle = window.adsbygoogle || []).push({});
</script>
</div>
<div>
<p>Autres outils dont vous aurez peut être besoin:</p>
</div>
</div>

              <div class="tool-category-list-list">
                <div class="tool-category-list-list-entry">
                  <a href="convertir-chiffre-romain-en-decimale-en-ligne.html">Convertir Romain en Décimal</a>
                </div> 
                <div class="tool-category-list-list-entry">
                  <a href="convertir-chiffre-decimale-en-romain-en-ligne.html">Convertir Décimal en Romain</a>
                </div> 
                <div class="tool-category-list-list-entry">
                  <a href="convertir-chiffres-en-lettres-en-ligne.html">Convertir chiffres en Mots</a>
                </div> 
                <div class="tool-category-list-list-entry">
                  <a href="convertir-lettres-en-chiffres-en-ligne.html">Convertir Mots en chiffres</a>
                </div> 
                <div class="tool-category-list-list-entry">
                  <a href="generateur-mot-de-passe-aleatoire.html">Générateur de Mot de Passe</a>
                </div> 
                <div class="tool-category-list-list-entry">
                  <a href="extraire-nombres.html">Extraire les Chiffres du Text</a>
                </div> 
                <div class="tool-category-list-list-entry">
                  <a href="generateur-fractions-decimale-aleatoire.html">Générateur de Nombre Décimal en Fraction</a>
                </div> 
                <div class="tool-category-list-list-entry">
                  <a href="generateur-binaire-aleatoire.html">Générateur de Nombre Binaire Aléatoire</a>
                </div> 
                <div class="tool-category-list-list-entry">
                  <a href="generateur-octale-aleatoire.html">Générateur de Nombre Octale Aléatoire</a>
                </div> 
                <div class="tool-category-list-list-entry">
                  <a href="generateur-decimale-aleatoire.html">Générateur de Nombre Décimal Aléatoire</a>
                </div> 
                <div class="tool-category-list-list-entry">
                  <a href="generateur-hexadecimale-aleatoire.html">Générateur de Nombre Hexadécimal Aléatoire</a>
                </div> 
              </div>
			  
			   


			  <div id="tools">
			  <p></p>
                    <p>Les nombres al&eacute;atoires sont utilis&eacute;s depuis plusieurs milliers d'ann&eacute;es. Qu'il s'agisse de lancer une pi&egrave;ce ou de lancer un d&eacute;, le but est de laisser le r&eacute;sultat final au hasard. Les g&eacute;n&eacute;rateurs de nombres al&eacute;atoires dans un ordinateur sont similaires - ils tentent d'obtenir un r&eacute;sultat al&eacute;atoire impr&eacute;visible.</p>
<p>Les g&eacute;n&eacute;rateurs de nombres al&eacute;atoires sont utiles &agrave; de nombreuses fins diff&eacute;rentes. Outre les applications &eacute;videntes comme la g&eacute;n&eacute;ration de nombres al&eacute;atoires &agrave; des fins de jeu ou la cr&eacute;ation de r&eacute;sultats impr&eacute;visibles dans un jeu informatique, le caract&egrave;re al&eacute;atoire est important pour la cryptographie.</p>
<p>La cryptographie n&eacute;cessite des chiffres que les attaquants ne peuvent pas deviner. Nous ne pouvons pas simplement utiliser les m&ecirc;mes chiffres encore et encore. Nous voulons g&eacute;n&eacute;rer ces nombres de mani&egrave;re tr&egrave;s impr&eacute;visible afin que les attaquants ne puissent pas les deviner. Ces nombres al&eacute;atoires sont essentiels pour le cryptage s&eacute;curis&eacute;, que vous cryptiez vos propres fichiers ou que vous utilisiez simplement un site Web HTTPS sur Internet.</p>
<h3>Nombres al&eacute;atoires vrais</h3>
<p><br />Vous vous demandez peut-&ecirc;tre comment un ordinateur peut g&eacute;n&eacute;rer un nombre al&eacute;atoire. D'o&ugrave; vient ce "hasard"? Si c'est juste un morceau de code informatique, n'est-il pas possible que les chiffres g&eacute;n&eacute;r&eacute;s par l'ordinateur soient pr&eacute;visibles?</p>
<p>Nous regroupons g&eacute;n&eacute;ralement les nombres al&eacute;atoires g&eacute;n&eacute;r&eacute;s par les ordinateurs en deux types, en fonction de la mani&egrave;re dont ils sont g&eacute;n&eacute;r&eacute;s: les nombres al&eacute;atoires &laquo;vrais&raquo; et les nombres pseudo-al&eacute;atoires.</p>
<p>Pour g&eacute;n&eacute;rer un &laquo;vrai&raquo; nombre al&eacute;atoire, l'ordinateur mesure un certain type de ph&eacute;nom&egrave;ne physique qui se produit en dehors de l'ordinateur. Par exemple, l'ordinateur peut mesurer la d&eacute;croissance radioactive d'un atome. Selon la th&eacute;orie quantique, il n'y a aucun moyen de savoir avec certitude quand la d&eacute;croissance radioactive se produira. Il s'agit donc essentiellement d'un &laquo;pur hasard&raquo; dans l'univers. Un attaquant ne serait pas en mesure de pr&eacute;dire le moment o&ugrave; la d&eacute;sint&eacute;gration radioactive se produirait, afin de ne pas conna&icirc;tre la valeur al&eacute;atoire.</p>
<p>Pour un exemple plus quotidien, l'ordinateur peut compter sur le bruit atmosph&eacute;rique ou simplement utiliser l'heure exacte sur laquelle vous appuyez sur les touches de votre clavier comme source de donn&eacute;es impr&eacute;visibles ou d'entropie. Par exemple, votre ordinateur peut remarquer que vous avez appuy&eacute; sur une touche exactement &agrave; 0.23423523 secondes apr&egrave;s 14h00. Prenez suffisamment de temps sp&eacute;cifique associ&eacute; &agrave; ces touches et vous aurez une source d'entropie que vous pourrez utiliser pour g&eacute;n&eacute;rer un &laquo;vrai&raquo; nombre al&eacute;atoire. Vous n'&ecirc;tes pas une machine pr&eacute;visible, donc un attaquant ne peut pas deviner le moment pr&eacute;cis o&ugrave; vous appuyez sur ces touches. Le p&eacute;riph&eacute;rique / dev / random sous Linux , qui g&eacute;n&egrave;re des nombres al&eacute;atoires, "bloque" et ne retourne pas de r&eacute;sultat tant qu'il ne recueille pas assez d'entropie pour renvoyer un nombre vraiment al&eacute;atoire.</p>
<h3>Nombres pseudo-al&eacute;atoires</h3>
<p><br />Les nombres pseudo-al&eacute;atoires sont une alternative aux &laquo;vrais&raquo; nombres al&eacute;atoires. Un ordinateur peut utiliser une valeur de d&eacute;part et un algorithme pour g&eacute;n&eacute;rer des nombres qui semblent &ecirc;tre al&eacute;atoires, mais qui sont en fait pr&eacute;visibles. L'ordinateur ne collecte aucune donn&eacute;e al&eacute;atoire provenant de l'environnement.</p>
<p>Ce n'est pas n&eacute;cessairement une mauvaise chose dans toutes les situations. Par exemple, si vous jouez &agrave; un jeu vid&eacute;o, peu importe que les &eacute;v&eacute;nements qui se produisent dans ce jeu soient caract&eacute;ris&eacute;s par des &laquo;vrais&raquo; nombres al&eacute;atoires ou des nombres pseudo-al&eacute;atoires. D'un autre c&ocirc;t&eacute;, si vous utilisez le chiffrement, vous ne voulez pas utiliser des nombres pseudo-al&eacute;atoires qu'un attaquant pourrait deviner.</p>
<p>Par exemple, supposons qu'un attaquant connaisse l'algorithme et la valeur de d&eacute;part utilis&eacute;s par un g&eacute;n&eacute;rateur de nombres pseudo-al&eacute;atoires. Et disons qu'un algorithme de chiffrement obtient un nombre pseudo-al&eacute;atoire de cet algorithme et l'utilise pour g&eacute;n&eacute;rer une cl&eacute; de chiffrement sans ajouter aucun caract&egrave;re al&eacute;atoire suppl&eacute;mentaire. Si un attaquant en sait assez, ils pourraient revenir en arri&egrave;re et d&eacute;terminer le nombre pseudo-al&eacute;atoire que l'algorithme de chiffrement doit avoir choisi dans ce cas, en cassant le chiffrement.</p>
<h3>Le g&eacute;n&eacute;rateur de nombres al&eacute;atoires de la NSA et d'Intel</h3>
<p><br />Pour faciliter les choses pour les d&eacute;veloppeurs et aider &agrave; g&eacute;n&eacute;rer des nombres al&eacute;atoires s&eacute;curis&eacute;s, les puces Intel incluent un g&eacute;n&eacute;rateur de nombres al&eacute;atoires bas&eacute; sur le mat&eacute;riel appel&eacute; RdRand. Cette puce utilise une source d'entropie sur le processeur et fournit des nombres al&eacute;atoires au logiciel lorsque le logiciel les demande.</p>
<p>Le probl&egrave;me ici est que le g&eacute;n&eacute;rateur de nombres al&eacute;atoires est essentiellement une bo&icirc;te noire et nous ne savons pas ce qui se passe &agrave; l&rsquo;int&eacute;rieur. Si RdRand contenait une porte d&eacute;rob&eacute;e NSA, le gouvernement serait en mesure de casser les cl&eacute;s de chiffrement g&eacute;n&eacute;r&eacute;es avec uniquement les donn&eacute;es fournies par ce g&eacute;n&eacute;rateur de nombres al&eacute;atoires.</p>
<p>C'est un probl&egrave;me s&eacute;rieux. En d&eacute;cembre 2013, les d&eacute;veloppeurs de FreeBSD ont supprim&eacute; le support de l'utilisation directe de RdRand comme source de caract&egrave;re al&eacute;atoire, affirmant qu'ils ne pouvaient pas lui faire confiance.&nbsp;La sortie du p&eacute;riph&eacute;rique RdRand serait introduite dans un autre algorithme qui ajoute une entropie suppl&eacute;mentaire, en veillant &agrave; ce que les portes arri&egrave;re du g&eacute;n&eacute;rateur de nombres al&eacute;atoires importent peu. Linux fonctionnait d&eacute;j&agrave; de cette fa&ccedil;on, en randomisant davantage les donn&eacute;es al&eacute;atoires provenant de RdRand, de mani&egrave;re &agrave; ce qu&rsquo;elles ne soient pas pr&eacute;visibles m&ecirc;me s&rsquo;il y avait une porte d&eacute;rob&eacute;e. Dans un r&eacute;cent AMA (&ldquo;Ask Me Anything&rdquo;) sur Reddit, le PDG d&rsquo;Intel, Brian Krzanich, n&rsquo;a pas r&eacute;pondu &agrave; ces questions.</p>
<p>Bien s&ucirc;r, ce n'est probablement pas seulement un probl&egrave;me avec les puces Intel. Les d&eacute;veloppeurs de FreeBSD ont &eacute;galement appel&eacute; les puces de Via. Cette controverse montre pourquoi il est si important de g&eacute;n&eacute;rer des nombres al&eacute;atoires vraiment al&eacute;atoires et impr&eacute;visibles.</p>
<p>Pour g&eacute;n&eacute;rer des &laquo;vrais&raquo; nombres al&eacute;atoires, les g&eacute;n&eacute;rateurs de nombres al&eacute;atoires rassemblent &laquo;l'entropie&raquo; ou des donn&eacute;es apparemment al&eacute;atoires du monde physique qui les entoure. Pour les nombres al&eacute;atoires qui n'ont pas vraiment besoin d'&ecirc;tre al&eacute;atoires, ils peuvent simplement utiliser un algorithme et une valeur de d&eacute;part.</p>
        </div>
      </div>
    </div>
  </div>
</div>


    <div id="footer">
      

      

      <div id="footer-copyright-legal-hf">
        <div id="copyright-legal">
          © 2017  All rights reserved.
          <div class="sep"></div>
          <a href="https://convertir.github.io/terms-of-service" rel="nofollow">Terms of Service</a>
          <div class="sep"></div>
          <a href="https://convertir.github.io/privacy-policy" rel="nofollow">Privacy Policy</a>
          <div class="sep"></div>
          
        </div>

        

        <div class="clear"></div>
      </div>
    </div>

    
    </div>

    
    <script>
      (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
      })(window,document,'script','../../www.google-analytics.com/analytics.js','ga');

      ga('create', 'UA-88954551-9', 'auto');
      ga('send', 'pageview');
    </script>
    

    <div id="fb-root"></div>

    
    
    

    
      
    
  </body>
</html>
